src/main/java/company/vk/edu/distrib/compute/kruchinina/replication/load_testing/with_qourum.txt
======================================
=== Нагрузочный тест (wrk2) ===
Режим: ack_write=2, ack_read=2
======================================
Running 30s test @ http://localhost:8000
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.704ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.700ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.40ms    0.91ms  17.47ms   87.46%
    Req/Sec   104.27    117.32   666.00     95.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.25ms
 75.000%    1.68ms
 90.000%    2.19ms
 99.000%    4.82ms
 99.900%   11.73ms
 99.990%   17.49ms
 99.999%   17.49ms
100.000%   17.49ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.207     0.000000            1         1.00
       0.620     0.100000          390         1.11
       0.825     0.200000          780         1.25
       0.974     0.300000         1174         1.43
       1.108     0.400000         1561         1.67
       1.246     0.500000         1953         2.00
       1.319     0.550000         2145         2.22
       1.393     0.600000         2342         2.50
       1.467     0.650000         2537         2.86
       1.558     0.700000         2732         3.33
       1.683     0.750000         2925         4.00
       1.741     0.775000         3023         4.44
       1.805     0.800000         3122         5.00
       1.875     0.825000         3222         5.71
       1.962     0.850000         3315         6.67
       2.071     0.875000         3414         8.00
       2.123     0.887500         3462         8.89
       2.191     0.900000         3510        10.00
       2.267     0.912500         3559        11.43
       2.359     0.925000         3608        13.33
       2.479     0.937500         3657        16.00
       2.551     0.943750         3681        17.78
       2.617     0.950000         3705        20.00
       2.729     0.956250         3730        22.86
       2.863     0.962500         3754        26.67
       2.983     0.968750         3779        32.00
       3.041     0.971875         3791        35.56
       3.159     0.975000         3803        40.00
       3.249     0.978125         3815        45.71
       3.495     0.981250         3827        53.33
       4.003     0.984375         3840        64.00
       4.271     0.985938         3846        71.11
       4.555     0.987500         3852        80.00
       4.727     0.989062         3858        91.43
       5.023     0.990625         3864       106.67
       5.375     0.992188         3870       128.00
       5.463     0.992969         3873       142.22
       5.683     0.993750         3876       160.00
       6.019     0.994531         3879       182.86
       6.219     0.995313         3882       213.33
       6.343     0.996094         3885       256.00
       6.615     0.996484         3887       284.44
       6.711     0.996875         3888       320.00
       7.035     0.997266         3890       365.71
       7.083     0.997656         3891       426.67
       7.343     0.998047         3893       512.00
       9.183     0.998242         3894       568.89
       9.183     0.998437         3894       640.00
      10.239     0.998633         3895       731.43
      11.727     0.998828         3896       853.33
      11.975     0.999023         3897      1024.00
      11.975     0.999121         3897      1137.78
      11.975     0.999219         3897      1280.00
      12.127     0.999316         3898      1462.86
      12.127     0.999414         3898      1706.67
      16.655     0.999512         3899      2048.00
      16.655     0.999561         3899      2275.56
      16.655     0.999609         3899      2560.00
      16.655     0.999658         3899      2925.71
      16.655     0.999707         3899      3413.33
      17.487     0.999756         3900      4096.00
      17.487     1.000000         3900          inf
#[Mean    =        1.397, StdDeviation   =        0.912]
#[Max     =       17.472, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 558.86KB read
  Non-2xx or 3xx responses: 2020
Requests/sec:    200.05
Transfer/sec:     18.63KB

======================================
=== Проверка консистентности (curl) ===
Количество проверок: 1000
======================================
Консистентность: 1000 / 1000 (100.00%)