src/main/java/company/vk/edu/distrib/compute/kruchinina/replication/load_testing/without_quorum.txt
======================================
=== Нагрузочный тест (wrk2) ===
Режим: ack_write=1, ack_read=1
======================================
Running 30s test @ http://localhost:8000
  2 threads and 100 connections
  Thread calibration: mean lat.: 1.287ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.312ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.34ms    0.96ms  15.42ms   93.08%
    Req/Sec   104.18    118.72   700.00     94.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.61ms
 90.000%    1.99ms
 99.000%    3.51ms
 99.900%   12.98ms
 99.990%   15.43ms
 99.999%   15.43ms
100.000%   15.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.187     0.000000            1         1.00
       0.606     0.100000          390         1.11
       0.794     0.200000          780         1.25
       0.944     0.300000         1172         1.43
       1.093     0.400000         1563         1.67
       1.230     0.500000         1950         2.00
       1.294     0.550000         2145         2.22
       1.369     0.600000         2340         2.50
       1.444     0.650000         2538         2.86
       1.521     0.700000         2731         3.33
       1.613     0.750000         2929         4.00
       1.669     0.775000         3024         4.44
       1.718     0.800000         3120         5.00
       1.772     0.825000         3219         5.71
       1.832     0.850000         3315         6.67
       1.911     0.875000         3414         8.00
       1.945     0.887500         3462         8.89
       1.989     0.900000         3510        10.00
       2.037     0.912500         3559        11.43
       2.099     0.925000         3608        13.33
       2.179     0.937500         3658        16.00
       2.245     0.943750         3681        17.78
       2.289     0.950000         3705        20.00
       2.369     0.956250         3730        22.86
       2.453     0.962500         3754        26.67
       2.535     0.968750         3780        32.00
       2.569     0.971875         3791        35.56
       2.645     0.975000         3803        40.00
       2.683     0.978125         3815        45.71
       2.831     0.981250         3827        53.33
       2.971     0.984375         3840        64.00
       3.085     0.985938         3846        71.11
       3.155     0.987500         3852        80.00
       3.363     0.989062         3858        91.43
       3.821     0.990625         3864       106.67
       4.479     0.992188         3870       128.00
       4.979     0.992969         3873       142.22
       5.519     0.993750         3876       160.00
       5.919     0.994531         3879       182.86
       8.155     0.995313         3882       213.33
      10.943     0.996094         3885       256.00
      11.127     0.996484         3887       284.44
      11.183     0.996875         3888       320.00
      11.591     0.997266         3890       365.71
      12.231     0.997656         3891       426.67
      12.639     0.998047         3893       512.00
      12.703     0.998242         3894       568.89
      12.703     0.998437         3894       640.00
      12.911     0.998633         3895       731.43
      12.983     0.998828         3896       853.33
      13.127     0.999023         3897      1024.00
      13.127     0.999121         3897      1137.78
      13.127     0.999219         3897      1280.00
      13.471     0.999316         3898      1462.86
      13.471     0.999414         3898      1706.67
      15.039     0.999512         3899      2048.00
      15.039     0.999561         3899      2275.56
      15.039     0.999609         3899      2560.00
      15.039     0.999658         3899      2925.71
      15.039     0.999707         3899      3413.33
      15.431     0.999756         3900      4096.00
      15.431     1.000000         3900          inf
#[Mean    =        1.336, StdDeviation   =        0.964]
#[Max     =       15.424, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 565.10KB read
  Non-2xx or 3xx responses: 2053
Requests/sec:    200.06
Transfer/sec:     18.84KB

======================================
=== Проверка консистентности (curl) ===
Количество проверок: 1000
======================================
Консистентность: 1000 / 1000 (100.00%)